
document.getElementById("apple").onclick = function(){
  alert("누르지 말랬잖아!");
}


// 주어;
// 주어.속성;
// 주어.주어.속성;
// 주어.속성.속성;

// 주어.명령어();
// 명령어 = 메소드, 함수
// 주어.함수(재료);

// 길동아;
// 홍길동.성별;
// 길동.왼팔.두께;
// 길동.신체조건.키 = 180;

// 길동.노래해(k-pop);
// 길동.노래해(); 괄호 필수

// window.close();

// window / document / location(문서의 주소 관장)


// 대소문자 구분 필수
// 구문 끝 세미콜론(;)
// 객체, 속성, 메소드, 함수의 구분은 마침표(.) 연산자
// 문자열은 따옴표(""'')
// 스크립트는 쓰여진 순서대로 실행
// 다수 공백 무시

// 자바스크립트는 컴파일이 필요 없는 인터프리터 언어이다.
//    자바, C, 파이썬 등은 컴파일 필요 
//   0 1 기계어 - 어셈블리어 CPU 명령어 - 컴파일러 (번역)
// 자바스크립트는 그 어떤 플랫폼이라도 브라우저만 있으면 ㅇㅋ

// alert("안녕하세요 \'저\'는 \"홍길동\"입니다.")
// 역슬래시 \ 를 붙여서 따옴표 사용 

// 줄바꿈은 \n 캐리지 리턴 \r
// alert("안녕하세요\n
// \'저\'는 \"홍길동\"입니다.");


// 변수 variables 변할 수 있는 Data를 담는 그릇

// var 만들 변수 이름;

// var aaa;  // 변수 생성
// aaa = 3;  // 변수 값
// alert(aaa); // 변수 대입 확인
// var aaa=3; alert(aaa);
// var aaa="3"; 문자열

// 논리적인 데이터 

// var a = 3;
// var b = c;
// var c = a=B;

// alelt(c);

// var a = "안녕";
// var b = "hello";
// var c = a=B;

// alelt(c문자열);


var arr = [20, 35, 40, 50];
alert(arr[0]);